tap "heroku/brew"
tap "hivemq/mqtt-cli"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
# Run your GitHub Actions locally
brew "act"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Automate deployment, configuration, and upgrading
brew "ansible"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# GNOME accessibility toolkit
brew "atk"
# Text processing system for reStructuredText
brew "docutils"
# Official Amazon AWS command-line interface
brew "awscli"
# Collection of portable C++ source libraries
brew "boost"
# Computational Geometry Algorithms Library
brew "cgal"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Spellchecker wrapping library
brew "enchant"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generic library support script
brew "libtool"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Multi-format archive and compression library
brew "libarchive"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg", link: false
# Command-line fuzzy finder written in Go
brew "fzf"
# Graphics library to dynamically manipulate images
brew "gd"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Libraries and data formats for array-oriented scientific data
brew "netcdf"
# Package for scientific computing with Python
brew "numpy"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Geospatial Data Abstraction Library
brew "gdal"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# GUI toolkit
brew "gtk+"
# Flexible API to implement spellchecking in GTK+ applications
brew "gspell"
# Text view with syntax, undo/redo, and text marks
brew "gtksourceview4"
# GNOME companion library to GObject and Gtk+
brew "libdazzle"
# Collection library providing GObject-based interfaces
brew "libgee"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Glib wrapper library around libgit2 git access library
brew "libgit2-glib"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# GObject plugin library
brew "libpeas"
# Library for storing/retrieving passwords and other secrets
brew "libsecret"
# GNOME GUI client to view git repositories
brew "gitg"
# Network related modules for glib
brew "glib-networking"
# Image manipulation
brew "netpbm"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2", link: false
# List USB devices, just like the Linux lsusb command
brew "lsusb"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Minimal dumb-terminal emulation program
brew "picocom"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# C++ wrapper library around CGAL
brew "sfcgal"
# SOcket CAT: netcat on steroids
brew "socat"
# User interface to the TELNET protocol
brew "telnet"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Allows connection to a computer remotely
cask "anydesk"
# Electronics prototyping platform
cask "arduino"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# 3D creation suite
cask "blender"
# E-books management software
cask "calibre"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Universal database tool and SQL client
cask "dbeaver-community"
# App to build and share containerized applications and microservices
cask "docker"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# 3D parametric modeler
cask "freecad"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Free and open-source painting and sketching program
cask "krita"
# Visual diff and merge tool
cask "meld"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# App to write, plan, collaborate, and get organized
cask "notion"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# Collaboration platform for API development
cask "postman"
# Free and open-source page layout program
cask "scribus"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# 3D printer and slicing GUI
cask "ultimaker-cura"
# Development environment
cask "vagrant"
# Virtualizer for x86 hardware
cask "virtualbox"
# Remote desktop application focusing on security
cask "vnc-viewer"
# HTML to PDF renderer
cask "wkhtmltopdf"
# Video communication and virtual meeting platform
cask "zoom"
